nfe.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2">
      <cUF>51</cUF>
      <versaoDados>2.00</versaoDados>
    </nfeCabecMsg>
  </soap:Header>
  <soap:Body>
    <nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2">
      <enviNFe versao="3.00" xmlns="http://www.portalfiscal.inf.br/nfe">
        <idLote>1</idLote>
        <indSinc>1</indSinc>
        <NFe xmlns="http://www.portalfiscal.inf.br/nfe">
          <infNFe Id="NFe51150401882109000162650010000123452010222458" versao="3.00">
            <ide>
              <cUF>51</cUF>
              <cNF>01022245</cNF>
              <natOp>VENDA DE MERCADORIA</natOp>
              <indPag>1</indPag>
              <mod>65</mod>
              <serie>1</serie>
              <nNF>12345</nNF>
              <dhEmi>2015-04-29T13:22:26-04:00</dhEmi>
              <tpNF>1</tpNF>
              <idDest>1</idDest>
              <cMunFG>5103403</cMunFG>
              <tpImp>4</tpImp>
              <tpEmis>1</tpEmis>
              <cDV>8</cDV>
              <tpAmb>2</tpAmb>
              <finNFe>1</finNFe>
              <indFinal>1</indFinal>
              <indPres>1</indPres>
              <procEmi>0</procEmi>
              <verProc>V2.245</verProc>
            </ide>
            <emit>
              <CNPJ>01882109000162</CNPJ>
              <xNome>COXIPO COM PROD PAPELARIA IMP EXPORTACAO LTDA EPP</xNome>
              <enderEmit>
                <xLgr>AVENIDA TENENTE-CORONEL DUARTE</xLgr>
                <nro>191</nro>
                <xBairro>CENTRO NORTE</xBairro>
                <cMun>5103403</cMun>
                <xMun>CUIABA</xMun>
                <UF>MT</UF>
                <CEP>78005500</CEP>
                <cPais>1058</cPais>
                <xPais>Brasil</xPais>
                <fone>9221211500</fone>
              </enderEmit>
              <IE>130333573</IE>
              <CRT>3</CRT>
            </emit>
            <dest>
              <CPF>00500113456</CPF>
              <xNome>GUSTAVO SILVA OLIVEIRA</xNome>
              <enderDest>
                <xLgr>RUA SEIS</xLgr>
                <nro>6</nro>
                <xCpl>fundos</xCpl>
                <xBairro>BELA VISTA</xBairro>
                <cMun>5103403</cMun>
                <xMun>CUIABA</xMun>
                <UF>MT</UF>
                <CEP>78050538</CEP>
                <cPais>1058</cPais>
                <xPais>BRASIL</xPais>
                <fone>9281833171</fone>
              </enderDest>
            </dest>
            <det nItem="1">
              <prod>
                <cProd>84776</cProd>
                <cEAN/>
                <xProd>SUP LAV BEGE LA 30YY 65 171 5296 P16L</xProd>
                <NCM>32091010</NCM>
                <CFOP>5405</CFOP>
                <uCom>UN</uCom>
                <qCom>1.0000</qCom>
                <vUnCom>230.0000</vUnCom>
                <vProd>230.00</vProd>
                <cEANTrib/>
                <uTrib>UN</uTrib>
                <qTrib>1.0000</qTrib>
                <vUnTrib>230.0000</vUnTrib>
                <indTot>1</indTot>
              </prod>
              <imposto>
                <ICMS>
                  <ICMS60>
                    <orig>0</orig>
                    <CST>60</CST>
                    <vBCSTRet>0.00</vBCSTRet>
                    <vICMSSTRet>0.00</vICMSSTRet>
                  </ICMS60>
                </ICMS>
                <PIS>
                  <PISAliq>
                    <CST>01</CST>
                    <vBC>230.00</vBC>
                    <pPIS>0.65</pPIS>
                    <vPIS>1.50</vPIS>
                  </PISAliq>
                </PIS>
                <COFINS>
                  <COFINSAliq>
                    <CST>01</CST>
                    <vBC>230.00</vBC>
                    <pCOFINS>3.00</pCOFINS>
                    <vCOFINS>6.90</vCOFINS>
                  </COFINSAliq>
                </COFINS>
              </imposto>
            </det>
            <det nItem="2">
              <prod>
                <cProd>14508</cProd>
                <cEAN>7891019152452</cEAN>
                <xProd>TINTA ACR DECORA SUPER LAV BRANCO ACET 3,6LT CORAL</xProd>
                <NCM>32091010</NCM>
                <CFOP>5405</CFOP>
                <uCom>UN</uCom>
                <qCom>1.0000</qCom>
                <vUnCom>55.0000</vUnCom>
                <vProd>55.00</vProd>
                <cEANTrib>7891019152452</cEANTrib>
                <uTrib>UN</uTrib>
                <qTrib>1.0000</qTrib>
                <vUnTrib>55.0000</vUnTrib>
                <vDesc>2.20</vDesc>
                <indTot>1</indTot>
              </prod>
              <imposto>
                <ICMS>
                  <ICMS60>
                    <orig>0</orig>
                    <CST>60</CST>
                    <vBCSTRet>0.00</vBCSTRet>
                    <vICMSSTRet>0.00</vICMSSTRet>
                  </ICMS60>
                </ICMS>
                <PIS>
                  <PISAliq>
                    <CST>01</CST>
                    <vBC>52.80</vBC>
                    <pPIS>0.65</pPIS>
                    <vPIS>0.34</vPIS>
                  </PISAliq>
                </PIS>
                <COFINS>
                  <COFINSAliq>
                    <CST>01</CST>
                    <vBC>52.80</vBC>
                    <pCOFINS>3.00</pCOFINS>
                    <vCOFINS>1.58</vCOFINS>
                  </COFINSAliq>
                </COFINS>
              </imposto>
            </det>
            <total>
              <ICMSTot>
                <vBC>0.00</vBC>
                <vICMS>0.00</vICMS>
                <vBCST>0.00</vBCST>
                <vST>0.00</vST>
                <vProd>285.00</vProd>
                <vFrete>0.00</vFrete>
                <vSeg>0.00</vSeg>
                <vDesc>2.20</vDesc>
                <vII>0.00</vII>
                <vIPI>0.00</vIPI>
                <vPIS>1.84</vPIS>
                <vCOFINS>8.48</vCOFINS>
                <vOutro>0.00</vOutro>
                <vNF>282.80</vNF>
              </ICMSTot>
            </total>
            <transp>
              <modFrete>9</modFrete>
            </transp>
            <pag>
              <tPag>03</tPag>
              <vPag>141.40</vPag>
              <card>
                <CNPJ>60889128000422</CNPJ>
                <tBand>02</tBand>
                <cAut>110011</cAut>
              </card>
            </pag>
            <pag>
              <tPag>03</tPag>
              <vPag>141.40</vPag>
              <card>
                <CNPJ>60889128000422</CNPJ>
                <tBand>02</tBand>
                <cAut>110011</cAut>
              </card>
            </pag>
            <infAdic/>
          </infNFe>
        </NFe>
      </enviNFe>
    </nfeDadosMsg>
  </soap:Body>
</soap:Envelope>